; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_5 ?v8)
		(pred_6 ?v5)
		(pred_3 ?v5)
		(pred_1 ?v8 ?v5)
		(pred_2)
		(pred_4 ?v8))

   (:action op_3
       :parameters  (?v6 ?v3)
       :precondition (and (not-eq ?v6 ?v3) 
                          (pred_6 ?v6) (pred_6 ?v3) (pred_3 ?v6))
       :effect (and  (pred_3 ?v3)
		     (not (pred_3 ?v6))))


   (:action op_2
       :parameters (?v1 ?v2)
       :precondition  (and  (pred_5 ?v1) (pred_6 ?v2)
			    (pred_1 ?v1 ?v2) (pred_3 ?v2) (pred_2))
       :effect (and (pred_4 ?v1)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v1  ?v2)
       :precondition  (and  (pred_5 ?v1) (pred_6 ?v2)
			    (pred_4 ?v1) (pred_3 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_2)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_04 obj_02 obj_06 obj_07 
          obj_03 obj_05 obj_01 
)
(:init
(pred_6 obj_04)
(pred_6 obj_02)
(pred_6 obj_06)
(pred_6 obj_07)
(pred_5 obj_03)
(pred_5 obj_05)
(pred_5 obj_01)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(pred_2)
(pred_1 obj_03 obj_04)
(pred_1 obj_05 obj_06)
(pred_1 obj_01 obj_07)
(pred_3 obj_07)
)
(:goal
(and
(pred_1 obj_03 obj_06)
(pred_1 obj_05 obj_02)
(pred_1 obj_01 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_03 obj_06) (pred_3 obj_02))
    (sometime-before  (pred_1 obj_05 obj_02) (pred_3 obj_04))
    (sometime-before  (pred_1 obj_01 obj_04) (pred_3 obj_02))
  )
)
)

; plan
1. (op_2 obj_01 obj_07)
   deleted: (pred_1 obj_01 obj_07) (pred_2)
   added: (pred_4 obj_01)
   goals met: 0 of 3
2. (op_3 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 0 of 3
3. (op_1 obj_01 obj_02)
   deleted: (pred_4 obj_01)
   added: (pred_1 obj_01 obj_02) (pred_2)
   goals met: 0 of 3
4. (op_3 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 0 of 3
5. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03 obj_04) (pred_2)
   added: (pred_4 obj_03)
   goals met: 0 of 3
6. (op_3 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 3
7. (op_1 obj_03 obj_06)
   deleted: (pred_4 obj_03)
   added: (pred_1 obj_03 obj_06) (pred_2)
   goals met: 1 of 3
8. (op_2 obj_05 obj_06)
   deleted: (pred_1 obj_05 obj_06) (pred_2)
   added: (pred_4 obj_05)
   goals met: 1 of 3
9. (op_3 obj_06 obj_02)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_02)
   goals met: 1 of 3
10. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_1 obj_05 obj_02) (pred_2)
   goals met: 2 of 3
11. (op_2 obj_01 obj_02)
   deleted: (pred_1 obj_01 obj_02) (pred_2)
   added: (pred_4 obj_01)
   goals met: 2 of 3
12. (op_3 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 2 of 3
13. (op_1 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_2)
   goals met: 3 of 3
